"""
Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік".
Для виробництва цих напоїв використовуються різні інгредієнти та обмежена кількість обладнання.
Задача полягає у максимізації виробництва, враховуючи обмежені ресурси.
1) "Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
2) "Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".
3) Обмеження ресурсів: 100 од. "Води", 50 од. "Цукру", 30 од. "Лимонного соку" та 40 од. "Фруктового пюре".
4) Виробництво одиниці "Лимонаду" вимагає 2 од. "Води", 1 од. "Цукру" та 1 од. "Лимонного соку".
5) Виробництво одиниці "Фруктового соку" вимагає 2 од. "Фруктового пюре" та 1 од. "Води".
"""
import pulp

# Ініціалізація моделі
model = pulp.LpProblem("Maximize Profit", pulp.LpMaximize)

# Визначення змінних
A = pulp.LpVariable('Лимонад', lowBound=0, cat='Integer')
B = pulp.LpVariable('Фруктовий сік', lowBound=0, cat='Integer')

# Функція цілі (Максимізація прибутку)
model += A + B, "Profit"

# Додавання обмежень
model += 2 * A + 1 * B <= 100, "Вода"
model += 1 * A <= 50, "Цукор"
model += 1 * A <= 30, "Лимонний сік"
model += 2 * B <= 40, "Фруктове пюре"

# Розв'язання моделі
model.solve()

# Вивід результатів
print("Виробляти лимонад:", A.varValue)
print("Виробляти фруктовий сік:", B.varValue)
